In [23]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

In [138]:
df=pd.read_csv('train.csv')
test_df=pd.read_csv('test.csv')

In [139]:
df.head()

,id,title,Rating,maincateg,platform,price1,actprice1,Offer %,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,16695,Fashionable & Comfortable Bellies For Women (...,3.9,Women,Flipkart,698,999,30.13%,38.0,7.0,17.0,9.0,6.0,3,3,0
1,5120,Combo Pack of 4 Casual Shoes Sneakers For Men ...,3.8,Men,Flipkart,999,1999,50.03%,531.0,69.0,264.0,92.0,73.0,29,73,1
2,18391,Cilia Mode Leo Sneakers For Women (White),4.4,Women,Flipkart,2749,4999,45.01%,17.0,4.0,11.0,3.0,2.0,1,0,1
3,495,Men Black Sports Sandal,4.2,Men,Flipkart,518,724,15.85%,46413.0,6229.0,1045.0,12416.0,5352.0,701,4595,1
4,16408,Men Green Sports Sandal,3.9,Men,Flipkart,1379,2299,40.02%,77.0,3.0,35.0,21.0,7.0,7,7,1

In [140]:
print(df.shape)

(15730, 16)

In [141]:
df.describe()

,id,Rating,price1,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
count,15730.000000,15730.000000,15730.000000,15730.000000,15052.000000,15152.000000,15142.000000,15191.000000,15499.000000,15730.000000,15730.000000,15730.000000
mean,10479.541577,4.012873,688.070693,1369.286777,3057.660776,423.976307,1585.239466,655.923310,357.260662,155.085188,275.500572,0.601526
std,6080.166276,0.298440,649.409586,1240.900227,11846.965689,1768.230384,6177.476241,2855.735531,1402.246610,558.650254,958.589075,0.489600
min,3.000000,0.000000,69.000000,42.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,5212.000000,3.900000,349.000000,699.000000,63.000000,9.000000,30.000000,12.000000,7.000000,3.000000,6.000000,0.000000
50%,10458.500000,4.000000,474.000000,999.000000,308.000000,44.000000,150.000000,60.000000,34.000000,17.000000,30.000000,1.000000
75%,15766.750000,4.200000,699.000000,1299.000000,1526.000000,215.000000,788.000000,300.000000,172.000000,77.000000,140.000000,1.000000
max,20973.000000,5.000000,5998.000000,13499.000000,289973.000000,45448.000000,151193.000000,74037.000000,34978.000000,11705.000000,18060.000000,1.000000

In [142]:
df.columns[df.isna().any()]

Index(['maincateg', 'norating1', 'noreviews1', 'star_5f', 'star_4f',
       'star_3f'],
      dtype='object')

In [143]:
df.isnull().sum()

id              0
title           0
Rating          0
maincateg     526
platform        0
price1          0
actprice1       0
Offer %         0
norating1     678
noreviews1    578
star_5f       588
star_4f       539
star_3f       231
star_2f         0
star_1f         0
fulfilled1      0
dtype: int64

In [144]:
newdf=df.dropna(subset=['norating1'])

In [145]:
newdf.isnull().sum()

id             0
title          0
Rating         0
maincateg     71
platform       0
price1         0
actprice1      0
Offer %        0
norating1      0
noreviews1    77
star_5f       79
star_4f       70
star_3f       37
star_2f        0
star_1f        0
fulfilled1     0
dtype: int64

In [146]:
newdf=newdf.dropna(subset=['noreviews1'])

In [147]:
newdf.isnull().sum()

id             0
title          0
Rating         0
maincateg     20
platform       0
price1         0
actprice1      0
Offer %        0
norating1      0
noreviews1     0
star_5f       20
star_4f       20
star_3f       15
star_2f        0
star_1f        0
fulfilled1     0
dtype: int64

In [148]:
newdf=newdf.dropna(subset=['maincateg'])
newdf.isnull().sum()

id            0
title         0
Rating        0
maincateg     0
platform      0
price1        0
actprice1     0
Offer %       0
norating1     0
noreviews1    0
star_5f       7
star_4f       6
star_3f       8
star_2f       0
star_1f       0
fulfilled1    0
dtype: int64

In [149]:
newdf=newdf.dropna(subset=['star_3f'])
newdf.isnull().sum()

id            0
title         0
Rating        0
maincateg     0
platform      0
price1        0
actprice1     0
Offer %       0
norating1     0
noreviews1    0
star_5f       1
star_4f       1
star_3f       0
star_2f       0
star_1f       0
fulfilled1    0
dtype: int64

In [150]:
newdf=newdf.dropna(subset=['star_5f','star_4f'])
newdf.isnull().sum()

id            0
title         0
Rating        0
maincateg     0
platform      0
price1        0
actprice1     0
Offer %       0
norating1     0
noreviews1    0
star_5f       0
star_4f       0
star_3f       0
star_2f       0
star_1f       0
fulfilled1    0
dtype: int64



## Now there are no null values in our dataset , hence the data set is fready for training the model

# DATA VISUALIZATION

## DATA PREPROCESSING

In [151]:
X=newdf.drop(['price1','title','Offer %'],axis=1)
X.head()
#X['Offer %'] = X['Offer %'].str.rstrip("%").astype(float)/100
X.head()

,id,Rating,maincateg,platform,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,16695,3.9,Women,Flipkart,999,38.0,7.0,17.0,9.0,6.0,3,3,0
1,5120,3.8,Men,Flipkart,1999,531.0,69.0,264.0,92.0,73.0,29,73,1
2,18391,4.4,Women,Flipkart,4999,17.0,4.0,11.0,3.0,2.0,1,0,1
3,495,4.2,Men,Flipkart,724,46413.0,6229.0,1045.0,12416.0,5352.0,701,4595,1
4,16408,3.9,Men,Flipkart,2299,77.0,3.0,35.0,21.0,7.0,7,7,1

In [152]:
y=newdf['price1']
y.head()

0     698
1     999
2    2749
3     518
4    1379
Name: price1, dtype: int64

In [153]:
X['maincateg']=X['maincateg'].map({'Men':0,'Women':1})
X['platform']=X['platform'].map({'Flipkart':0,'Amazon':1})
X.head(5)

,id,Rating,maincateg,platform,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,16695,3.9,1,0,999,38.0,7.0,17.0,9.0,6.0,3,3,0
1,5120,3.8,0,0,1999,531.0,69.0,264.0,92.0,73.0,29,73,1
2,18391,4.4,1,0,4999,17.0,4.0,11.0,3.0,2.0,1,0,1
3,495,4.2,0,0,724,46413.0,6229.0,1045.0,12416.0,5352.0,701,4595,1
4,16408,3.9,0,0,2299,77.0,3.0,35.0,21.0,7.0,7,7,1

In [154]:
print(X.shape)

(14945, 13)

## Splitting the data into training and validation

In [155]:
from sklearn.model_selection import train_test_split
X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.3, random_state=101)

In [156]:
print(X_train.shape)
print(X_val.shape)

(10461, 13)
(4484, 13)

## FEATURE SCALING

In [157]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
scaled_X_train=scaler.fit_transform(X_train)
scaled_X_val=scaler.transform(X_val)

### NOW AFTER ALL DATA CLEANING , DATA PREPROCESSING AND FEATURE SCALING WE HAVE OUR DATASET READY FOR TRAINING THE MODEL.

I am going to train my model based on following algorithms.
1.Linear Regression
2.Polynomial Regression
3.Lasso Regression
4.Ridge Regression
5.KNN
6.SVM
7.Decision Tree
8.Random Forest
9.Boosting Methods
10.ANN

In [158]:
from sklearn.metrics import mean_absolute_error,mean_squared_error

In [159]:
def report_model(model):
    model.fit(X_train,y_train)
    pred=model.predict(X_val)
    MAE=mean_absolute_error(pred,y_val)
    RMSE=np.sqrt(mean_squared_error(pred,y_val))
    mean_price=newdf['price1'].mean()
    mae_by_mean=(MAE/mean_price)*100
    rmse_by_mean=(RMSE/mean_price)*100
    print('The MAE of',model,'model is',MAE )
    print('The RMSE of',model,'model is',RMSE )
    print('The MAE as percentage of mean price is :' ,mae_by_mean,'%')
    print('The RMSE as percentage of mean price is :' ,rmse_by_mean,'%')

In [160]:
from sklearn.linear_model import LinearRegression
LR_model=LinearRegression()
report_model(LR_model)

The MAE of LinearRegression() model is 183.15483621312694
The RMSE of LinearRegression() model is 281.8331403972008
The MAE as percentage of mean price is : 26.614478001203935 %
The RMSE as percentage of mean price is : 40.95355640177153 %

In [161]:
mean_price=newdf['price1'].mean()
mean_price

688.177450652392

## DATA CLEANING & PREPROCESSING FOR TEST DATA

In [162]:
test_df.isnull().sum()
testdf=test_df.dropna(subset=['Rating','star_1f','star_5f','maincateg'])
testdf.isnull().sum()


X_test=testdf.drop(['title'],axis=1)
X_test.head()



X_test['maincateg']=X_test['maincateg'].map({'Men':0,'Women':1})
X_test['platform']=X_test['platform'].map({'Flipkart':0,'Amazon':1})
X_test.head()

,id,Rating,maincateg,platform,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,2242,3.8,0,0,999,27928,3543,14238.0,4295,3457,1962,3976.0,1
1,20532,3.9,1,0,499,3015,404,1458.0,657,397,182,321.0,1
2,10648,3.9,1,0,999,449,52,229.0,70,71,33,46.0,1
3,20677,3.9,0,0,2999,290,40,141.0,51,49,17,32.0,1
4,12593,3.9,0,0,999,2423,326,1265.0,414,293,143,308.0,0

#### NOW OUR TEST DATA IS READY FOR PREDICTIONS

In [167]:
final_model=LinearRegression()
X=scaler.fit_transform(X)
X_test=scaler.transform(X_test)
final_model.fit(X,y)
predictions=final_model.predict(X_test)

print(predictions)

[447.7264285  294.59466605 518.20473172 ... 439.33547107 208.93428257
 669.82421878]

In [170]:
product_id=testdf['id']
print(product_id)
price=pd.Series(predictions)
print(price)
#submission= pd.merge(product_id, predictions, right_index = True,left_index = True)
#submission

0        2242
1       20532
2       10648
3       20677
4       12593
        ...
5238    12515
5240      297
5241    18733
5242     6162
5243    13574
Name: id, Length: 4994, dtype: int64
0        447.726428
1        294.594666
2        518.204732
3       1433.318491
4        465.236437
           ...
4989    2155.966749
4990     909.622753
4991     439.335471
4992     208.934283
4993     669.824219
Length: 4994, dtype: float64

In [173]:
data = {"id": product_id,"price": price}

In [174]:
submission = pd.concat(data,axis = 1)

In [175]:
submission

           id        price
0      2242.0   447.726428
1     20532.0   294.594666
2     10648.0   518.204732
3     20677.0  1433.318491
4     12593.0   465.236437
...       ...          ...
5238  12515.0          NaN
5240    297.0          NaN
5241  18733.0          NaN
5242   6162.0          NaN
5243  13574.0          NaN

[5229 rows x 2 columns]